pulp-bio/biogui_getting_started/stm32-streamer/Core/Inc/lsm6dsox_reg.h
int32_t lsm6dsox_angular_rate_raw_get(stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t lsm6dsox_acceleration_raw_get(stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t lsm6dsox_fifo_out_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsox_ois_angular_rate_raw_get(stmdev_ctx_t *ctx,
                                          int16_t *val);

int32_t lsm6dsox_ois_acceleration_raw_get(stmdev_ctx_t *ctx,
                                          int16_t *val);

int32_t lsm6dsox_aux_temperature_raw_get(stmdev_ctx_t *ctx,
                                         int16_t *val);

int32_t lsm6dsox_aux_ois_angular_rate_raw_get(stmdev_ctx_t *ctx,
                                              int16_t *val);

int32_t lsm6dsox_aux_ois_acceleration_raw_get(stmdev_ctx_t *ctx,
                                              int16_t *val);

int32_t lsm6dsox_number_of_steps_get(stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t lsm6dsox_steps_reset(stmdev_ctx_t *ctx);

int32_t lsm6dsox_mlc_out_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsox_odr_cal_reg_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_odr_cal_reg_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_USER_BANK           = 0,
  LSM6DSOX_SENSOR_HUB_BANK     = 1,
  LSM6DSOX_EMBEDDED_FUNC_BANK  = 2,
} lsm6dsox_reg_access_t;
int32_t lsm6dsox_mem_bank_set(stmdev_ctx_t *ctx,
                              lsm6dsox_reg_access_t val);
int32_t lsm6dsox_mem_bank_get(stmdev_ctx_t *ctx,
                              lsm6dsox_reg_access_t *val);

int32_t lsm6dsox_ln_pg_write_byte(stmdev_ctx_t *ctx, uint16_t address,
                                  uint8_t *val);
int32_t lsm6dsox_ln_pg_read_byte(stmdev_ctx_t *ctx, uint16_t address,
                                 uint8_t *val);

int32_t lsm6dsox_ln_pg_write(stmdev_ctx_t *ctx, uint16_t address,
                             uint8_t *buf, uint8_t len);
int32_t lsm6dsox_ln_pg_read(stmdev_ctx_t *ctx, uint16_t address,
                            uint8_t *val);

typedef enum
{
  LSM6DSOX_DRDY_LATCHED = 0,
  LSM6DSOX_DRDY_PULSED  = 1,
} lsm6dsox_dataready_pulsed_t;
int32_t lsm6dsox_data_ready_mode_set(stmdev_ctx_t *ctx,
                                     lsm6dsox_dataready_pulsed_t val);
int32_t lsm6dsox_data_ready_mode_get(stmdev_ctx_t *ctx,
                                     lsm6dsox_dataready_pulsed_t *val);

int32_t lsm6dsox_device_id_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsox_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_auto_increment_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_auto_increment_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_XL_ST_DISABLE  = 0,
  LSM6DSOX_XL_ST_POSITIVE = 1,
  LSM6DSOX_XL_ST_NEGATIVE = 2,
} lsm6dsox_st_xl_t;
int32_t lsm6dsox_xl_self_test_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_xl_t val);
int32_t lsm6dsox_xl_self_test_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_xl_t *val);

typedef enum
{
  LSM6DSOX_GY_ST_DISABLE  = 0,
  LSM6DSOX_GY_ST_POSITIVE = 1,
  LSM6DSOX_GY_ST_NEGATIVE = 3,
} lsm6dsox_st_g_t;
int32_t lsm6dsox_gy_self_test_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_g_t val);
int32_t lsm6dsox_gy_self_test_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_g_t *val);

int32_t lsm6dsox_xl_filter_lp2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_xl_filter_lp2_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_gy_filter_lp1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_gy_filter_lp1_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_filter_settling_mask_set(stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6dsox_filter_settling_mask_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  LSM6DSOX_ULTRA_LIGHT  = 0,
  LSM6DSOX_VERY_LIGHT   = 1,
  LSM6DSOX_LIGHT        = 2,
  LSM6DSOX_MEDIUM       = 3,
  LSM6DSOX_STRONG       = 4,
  LSM6DSOX_VERY_STRONG  = 5,
  LSM6DSOX_AGGRESSIVE   = 6,
  LSM6DSOX_XTREME       = 7,
} lsm6dsox_ftype_t;
int32_t lsm6dsox_gy_lp1_bandwidth_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_ftype_t val);
int32_t lsm6dsox_gy_lp1_bandwidth_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_ftype_t *val);

int32_t lsm6dsox_xl_lp2_on_6d_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_xl_lp2_on_6d_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_HP_PATH_DISABLE_ON_OUT    = 0x00,
  LSM6DSOX_SLOPE_ODR_DIV_4           = 0x10,
  LSM6DSOX_HP_ODR_DIV_10             = 0x11,
  LSM6DSOX_HP_ODR_DIV_20             = 0x12,
  LSM6DSOX_HP_ODR_DIV_45             = 0x13,
  LSM6DSOX_HP_ODR_DIV_100            = 0x14,
  LSM6DSOX_HP_ODR_DIV_200            = 0x15,
  LSM6DSOX_HP_ODR_DIV_400            = 0x16,
  LSM6DSOX_HP_ODR_DIV_800            = 0x17,
  LSM6DSOX_HP_REF_MD_ODR_DIV_10      = 0x31,
  LSM6DSOX_HP_REF_MD_ODR_DIV_20      = 0x32,
  LSM6DSOX_HP_REF_MD_ODR_DIV_45      = 0x33,
  LSM6DSOX_HP_REF_MD_ODR_DIV_100     = 0x34,
  LSM6DSOX_HP_REF_MD_ODR_DIV_200     = 0x35,
  LSM6DSOX_HP_REF_MD_ODR_DIV_400     = 0x36,
  LSM6DSOX_HP_REF_MD_ODR_DIV_800     = 0x37,
  LSM6DSOX_LP_ODR_DIV_10             = 0x01,
  LSM6DSOX_LP_ODR_DIV_20             = 0x02,
  LSM6DSOX_LP_ODR_DIV_45             = 0x03,
  LSM6DSOX_LP_ODR_DIV_100            = 0x04,
  LSM6DSOX_LP_ODR_DIV_200            = 0x05,
  LSM6DSOX_LP_ODR_DIV_400            = 0x06,
  LSM6DSOX_LP_ODR_DIV_800            = 0x07,
} lsm6dsox_hp_slope_xl_en_t;
int32_t lsm6dsox_xl_hp_path_on_out_set(stmdev_ctx_t *ctx,
                                       lsm6dsox_hp_slope_xl_en_t val);
int32_t lsm6dsox_xl_hp_path_on_out_get(stmdev_ctx_t *ctx,
                                       lsm6dsox_hp_slope_xl_en_t *val);

int32_t lsm6dsox_xl_fast_settling_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_xl_fast_settling_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

